<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"737060b5705a9571759a35234208a2a01b779dad8a0ef362c1afcc276130f25b","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1107 at https://github.com/cal-itp/data-infra/actions/runs/19835386467","plan_out_hash":"8e3387b7115a376d9d5aa2ffaa09e0a48f87697ffc2342173a02acd5e57ce52f","plan_hash":"d58bb015893a37cc9a94c8e3e8c1a82d05c5963d43f5404c7622a75b3e15436c","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "00iJ/w==" -> (known after apply)
!~      detect_md5hash      = "yfkZas/eBQMAqfz2eXnuDw==" -> "different hash"
!~      generation          = 1764100054963994 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "yfkZas/eBQMAqfz2eXnuDw==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "S9xfig==" -> (known after apply)
!~      detect_md5hash      = "GEAgWaMaB3xMcxPCFeJXSg==" -> "different hash"
!~      generation          = 1764100056657852 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "GEAgWaMaB3xMcxPCFeJXSg==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1107](https://github.com/cal-itp/data-infra/actions/runs/19835386467)